//=============================================================================
//
// スコア処理 [score.h]
// Author : GP11B132 33 呉優
//
//=============================================================================
#pragma once
#include "main.h"
#include "renderer.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define		SCORE_MAX			9999999999			// スコアの最大値
#define		SCORE_DIGIT			10					// 桁数

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScore(void);
void UninitScore(void);
void UpdateScore(void);
void DrawScore(float alpha);

void AddScore(int add);
int GetScore(void);